Revit 2024 API
DGNExportOptions Class
 The export options used by exporting DGN format file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DGNExportOptions : BaseExportOptions
Visual Basic
Public Class DGNExportOptions _
	Inherits BaseExportOptions
Visual C++
public ref class DGNExportOptions : public BaseExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.DGNExportOptions
See Also
DGNExportOptions Members
Autodesk.Revit.DB Namespace